zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pic32cm6408pl10028.h
/* ************************************************************************** */
/*                  Event Generator IDs for C32CM6408PL10028                  */
/* ************************************************************************** */
#define EVENT_ID_GEN_OSC32KCTRL_CLKFAIL                   1 /* ID for OSC32KCTRL event generator CLKFAIL */
#define EVENT_ID_GEN_SUPC_MVIO                            2 /* ID for SUPC event generator MVIO */
#define EVENT_ID_GEN_SUPC_VLM                             3 /* ID for SUPC event generator VLM */
#define EVENT_ID_GEN_RTC_CMP_0                            4 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            5 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              6 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            7 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            8 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            9 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                           10 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                           11 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                           12 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           13 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           14 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        15 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        16 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        17 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        18 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        19 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        20 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        21 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        22 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        23 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        24 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       25 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       26 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       27 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       28 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       29 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       30 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           31 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           32 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_TC0_OVF                             33 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            34 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            35 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             36 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            37 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            38 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             39 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            40 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            41 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_OVF                            42 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            43 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            44 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           45 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           46 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           47 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           48 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_ADC0_RESRDY                         49 /* ID for ADC0 event generator RESRDY */
#define EVENT_ID_GEN_ADC0_SAMPRDY                        50 /* ID for ADC0 event generator SAMPRDY */
#define EVENT_ID_GEN_ADC0_WCMP                           51 /* ID for ADC0 event generator WCMP */
#define EVENT_ID_GEN_AC_COMP_0                           52 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           53 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            54 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        55 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        56 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                        57 /* ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                        58 /* ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_SYSCTRL_OSCTEST                     59 /* ID for SYSCTRL event generator OSCTEST */
#define EVENT_ID_GEN_PAC_ACCERR                          60 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_DSU_SWCCSTAT                        61 /* ID for DSU event generator SWCCSTAT */
#define EVENT_ID_GEN_DSU_COMP                            62 /* ID for DSU event generator COMP */

/* ************************************************************************** */
/*                    Event User IDs for C32CM6408PL10028                     */
/* ************************************************************************** */
#define EVENT_ID_USER_PORT_EV_0                           0 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           1 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           2 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           3 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           4 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           5 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_TC0_EVU                             6 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                             7 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                             8 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TCC0_EV_0                           9 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          10 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          11 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          12 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          13 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          14 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_ADC0_START                         15 /* ID for ADC0 event user START */
#define EVENT_ID_USER_CCL_LUTIN_0                        16 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        17 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        18 /* ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        19 /* ID for CCL event user LUTIN_3 */
#define EVENT_ID_USER_MTB_START                          20 /* ID for MTB event user START */
#define EVENT_ID_USER_MTB_STOP                           21 /* ID for MTB event user STOP */
#define EVENT_ID_USER_SYSCTRL_OSCTEST                    22 /* ID for SYSCTRL event user OSCTEST */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CM6408PL10028_H_ */

